# Aggregateing DataFrames
### You can aggregate a DateFrame column by using aggregation methods (like series!)

In [1]:
import numpy as np
import pandas as pd

In [2]:
retail = pd.read_csv("../Agg_&_Reshape_DataFrames/retail_2016_2017.csv")
retail

,id,date,store_nbr,family,sales,onpromotion
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0
1,1945945,2016-01-01,1,BABY CARE,0.000,0
2,1945946,2016-01-01,1,BEAUTY,0.000,0
3,1945947,2016-01-01,1,BEVERAGES,0.000,0
4,1945948,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [6]:
retail.loc[:, ["sales", "onpromotion"]].sample(100).sum().round(2)

sales          30925.0
onpromotion      475.0
dtype: float64

In [7]:
retail.loc[:, ["sales", "onpromotion"]].sample(100).mean().round(2)

sales          265.42
onpromotion      3.43
dtype: float64

### More Examples

In [9]:
premier_league = pd.read_excel("../Agg_&_Reshape_DataFrames/premier_league_games.xlsx")
premier_league.head()

,id,league_name,season,HomeTeam,AwayTeam,HomeGoals,AwayGoals
0,4389,England Premier League,2015/2016,Arsenal,West Ham United,0,2
1,4390,England Premier League,2015/2016,Bournemouth,Aston Villa,0,1
2,4391,England Premier League,2015/2016,Chelsea,Swansea City,2,2
3,4392,England Premier League,2015/2016,Everton,Watford,2,2
4,4393,England Premier League,2015/2016,Leicester City,Sunderland,4,2

In [14]:
premier_league.loc[:, ["HomeGoals", "AwayGoals"]].sum()

HomeGoals    567
AwayGoals    459
dtype: int64

In [15]:
premier_league.describe().round(2)

            id  HomeGoals  AwayGoals
count   380.00     380.00     380.00
mean   4578.50       1.49       1.21
std     109.84       1.26       1.15
min    4389.00       0.00       0.00
25%    4483.75       1.00       0.00
50%    4578.50       1.00       1.00
75%    4673.25       2.00       2.00
max    4768.00       6.00       6.00